[
  {
    "text":"<b>Операционная система</b> – базовое системное программное обеспечение, управляющее работой компьютера и являющееся посредником (интерфейсом) между аппаратурой (hardware), прикладным программным обеспечением (application software) и пользователем компьютера (user). Фактически ОС с точки зрения пользователя – это как бы продолжение аппаратуры, надстройка над ней, обеспечивающая более удобное, надежное и безопасное использование компьютеров и компьютерных сетей."
  },
  {
    "text":"Основные цели работы операционной системы следующие."
  }, 
  {
    "text":"1. Обеспечение корректности, эффективности, надежности выполнения пользовательских программ. Самое главное для пользователя – это стабильная работа компьютера, корректность выполняемых действий, стабильность и надежность. Гарантом выполнения всех этих требований является операционная система. "
  }, 
  {
    "text":"2. Обеспечение комфорта, эффективности, надежности, безопасности использования компьютера. Операционная система обеспечивает максимальную полезность и эффективность использования компьютера и его ресурсов, обрабатывает прерывания, защищает компьютер от сбоев, отказов и хакерских атак. Эта деятельность ОС может быть не столь заметной для пользователя, но она осуществляется постоянно. "
  }, 
  {
    "text":"3. Особая функция операционной системы, без которой невозможно использовать компьютер - это работа с внешними устройствами. Например, ОС обрабатывает любое обращение к жесткому диску, обеспечивая работу соответствующего драйвера (низкоуровневой программы для обмена информацией с диском) и контроллера (специализированного процессора, выполняющего команды ввода-вывода с диском). Любая флэшка, вставленная в USB-слот компьютера, распознается операционной системой, получает свое логическое имя (в системе Windows – в виде буквы, например, F) и становится частью файловой системы компьютера на все время, пока она не будет извлечена (демонтирована)."
  }, 
  {
    "text":"Компоненты компьютерной системы"
  }, 
  {
    "text":"Чтобы лучше понять место и роль операционной системы в процессе вычислений, рассмотрим компьютерную систему в целом. Она состоит из следующих компонентов:"
  }, 
  {
    "text":"1. Аппаратура (hardware) компьютера, основные части которой – центральный процессор (Central Processor Unit - CPU), выполняющий команды (инструкции) компьютера; память (memory), хранящая данные и программы, и устройства ввода- вывода, или внешние устройства, обеспечивающие ввод информации в компьютер и вывод результатов работы программ в форме, воспринимаемой пользователем- человеком или другими программами. Часто на программистском сленге аппаратуру называют железом."
  },
  {
    "text":"2. Операционная система (operating system) –системное программное обеспечение, управляющее использованием аппаратуры компьютера различными программами и пользователями."
  }, 
  {
    "text":"3. Прикладное программное обеспечение (applications software) – программы, предназначенные для решения различных классов задач. К ним относятся графические программы, игры, офисные программы. Прикладное программное обеспечение образует следующий, более высокий уровень, по сравнению с операционной системой, и позволяет решать на компьютере различные прикладные и повседневные задачи. "
  }, 
  {
    "text":"4. Пользователи (users) – люди и другие компьютеры. Отнесение пользователя - человека к компонентам компьютерной системы - вовсе не шутка, а реальность: любой пользователь фактически становится частью вычислительной системы в процессе своей работы на компьютере, так как должен подчиняться определенным строгим правилам, нарушение которых приведет к ошибкам или невозможности использования компьютера, и выполнять большой объем типовых рутинных действий – почти как сам компьютер. Одна из важных функций ОС как раз и состоит в том, чтобы избавить пользователя от большей части такой рутинной работы (например, резервного копирования файлов) и позволить ему сосредоточиться на работе творческой. Другие компьютеры в сети также могут играть роль пользователей (клиентов) по отношению к данному компьютеру, выступающему в роли сервера, используемого, например, для хранения файлов или выполнения больших программ. "
  }, 
  {
    "text":"Пользователям компьютера доступны верхние уровни программного обеспечения – системные и прикладные программы (например, текстовые редакторы, браузеры). Эти программы взаимодействуют с операционной системой, которая, в свою очередь, управляет работой компьютера."
  }, 
  {
    "text":"Классификация компьютерных систем "
  }, 
  {
    "text":"Для того, чтобы представить себе разнообразие операционных систем, рассмотрим, прежде всего, классификацию некоторых современных компьютерных систем, для которых разрабатываются и используются ОС – от суперкомпьютеров до мобильных устройств, - и узнаем требования к ОС для этих классов компьютеров."
  }, 
  {
    "text":"Суперкомпьютеры (super-computers) – мощные многопроцессорные компьютеры. Пример – суперкомпьютер «Ломоносов», установленный в МГУ. Суперкомпьютеры используются для вычислений, требующих больших вычислительных мощностей, сверхвысокой производительности и большого объема памяти. В реальной практике это прежде всего задачи моделирования – например, моделирования климата в регионе и прогнозирования на основе построенной модели погоды в данном регионе на ближайшие дни. Особенностью суперкомпьютеров является их параллельная архитектура – как правило, все они являются многопроцессорными. Соответственно, ОС для суперкомпьютеров должны поддерживать распараллеливание решения задач и синхронизацию параллельных процессов, одновременно решающих подзадачи некоторой программы."
  }, 
  {
    "text":"Кластеры компьютеров (computer clusters) – группы компьютеров, физически расположенные рядом и соединенные друг с другом высокоскоростными линиями связи. Кластеры компьютеров используются для высокопроизводительных параллельных вычислений. Наиболее известны в мире компьютерные кластеры, расположенные в исследовательском центре CERN (Швейцария) – том самом, где находится большой адронный коллайдер. Операционная система для кластеров должна, помимо общих возможностей, предоставлять средства для конфигурирования кластера, управления компьютерами (процессорами), входящими в него, распараллеливания решения задач между компьютерами кластера."
  }, 
  {
    "text":"Настольные компьютеры (desktops) – это наиболее распространенные в настоящее время компьютеры, которыми пользуются дома или на работе все люди, от школьников и студентов до домашних хозяек. Такой компьютер размещается на рабочем столе и состоит из монитора, системного блока, клавиатуры и мыши. Параметры современного настольного компьютера, наиболее приемлемые для использования современных ОС: Windows, Linux, MacOS и др. При необходимости на настольном компьютере можно установить две или более операционных системы, разделив его дисковую память на несколько разделов (partitions) и установив на каждый из них свою операционную систему, так что при включении компьютера пользователю предоставляется стартовое меню, из которого он выбирает нужную операционную систему для загрузки."
  }, 
  {
    "text":"Портативные компьютеры (laptops, notebooks – дословно компьютеры, помещающиеся на коленях; компьютеры-тетрадки) – это миниатюрные компьютеры, по своим параметрам не уступающие настольным, но по своим размерам свободно помещающиеся в небольшую сумку. На ноутбуках используются те же операционные системы, что и для настольных компьютеров (например, Windows или MacOS)."
  }, 
  {
    "text":"Мобильные устройства (mobile intelligent devices – мобильные телефоны, коммуникаторы) – это устройства, которыми каждый из нас пользуется постоянно для голосовой связи, для записи или обработки какой-либо информации или для выхода в Интернет. Операционные системы для мобильных устройств отличаются большей компактностью, ввиду более жестких ограничений по памяти. Наиболее современным и обеспечивающим лучший пользовательский интерфейс обладают ОС Google Android и IOS. Для мобильных устройств, как и для КПК, весьма важная характеристика ОС – это ее надежность, в частности, сохранность данных после переполнения памяти, возникающего, например, в результате приема большого числа SMS-сообщений, интенсивной фото- или видеосъемки. Что касается программного обеспечения для мобильных телефонов (игр, утилит, прикладных программ и др.), то при их разработке доминирует Java-технология."
  }, 
  {
    "text":"Носимые компьютеры (wearable computers) – для повседневной жизни достаточно экзотические устройства, однако для специальных применений (например, встроенные в скафандр космонавта или в кардиостимулятор) они жизненно важны. Разумеется, их память и быстродействие значительно меньше, чем у настольных компьютеров, но критическим фактором является их сверхвысокая надежность, а для их операционных систем и прочего программного обеспечения – минимальное возможное время ответа – интервал, в течение которого система обрабатывает информацию от датчиков, от пользователя или из сети, превышение которого грозит катастрофическими последствиями. С этой точки зрения, ОС для носимых компьютеров можно отнести к системам реального времени. "
  }, 
  {
    "text":"Приведенный обзор дает некоторое представление о разнообразии компьютерных систем в наше время. Для каждой из них должна быть разработана своя адекватная операционная система. Разберем основные классификации ОС."
  }, 
   {
    "text":"По числу одновременно обслуживаемых пользователей ОС подразделяют на однопользовательские (одновременно поддерживается не более одного сеанса пользователя) и многопользовательские (одновременно поддерживается множество сеансов пользователя). Многопользовательские системы, кроме обеспечения защиты данных пользователей от несанкционированного доступа других пользователей, предоставляют средства разделения общих данных между многими пользователями. "
  },
   {
    "text":"Так же операционные системы бывают однозадачные и многозадачные:"
  },
   {
    "text":"Однозадачные ОС. Такие 0С предназначены для одновременно то выполнения только одной задачи. Запуск программ в таких 0С чисто последовательный. В случае, если одной из программ требуется вызвать на выполнение другую программу, сохраняется окружение вызывающей программы и по завершению вызываемой программы окружение восстанавливается. Однозадачные 0С могут быть и многопользовательскими. В таких 0С пользователи формируют очередь заданий на выполнение программ, при этом задания могут принадлежать различным пользователям. Система последовательно выполняет программы разных пользователей."
  },
   {
    "text":"Многозадачные ОС. В многозадачных 0С в один момент времени в системе может быть запущено много программ (процессов). В этом случае система управления процессами включает в себя планировщик процессов, выполняющий следующие функции:"
  },
   {
    "text":"•	распределение системных ресурсов между процессами - планирование выполнения процессов, формирование очереди процессов и управление приоритетами процессов в очереди;"
  },
   {
    "text":"•	межпроцессное взаимодействие - распределение общих данных между процессами ."
  },
   {
    "text":"Ниже представлены картинки, схемы, примеры операционных систем. Так же обязательно посмотрите видео по данной теме, с помощью которых вы сможете более глубоко разобраться в данной теме и маленько развеяться."
  },
   {
    "text":" В конце страницы нажимаем на кнопку пройти тест и проходим тест по данной теме."
  },
  
]
